---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGuidKey.Dispose
source: html/8fc43515-a010-ab17-a0a8-833693853a65.htm
---
# Autodesk.Revit.DB.IFC.IFCGuidKey.Dispose Method

Releases all resources used by the IFCGuidKey

## Syntax (C#)
```csharp
public void Dispose()
```